<template>
    <section class="ls-reviews">
        <p class="ls-reviews__title ls-h2" id="reviews">Отзывы</p>
        <div class="ls-reviews__layout">
            <div class="ls-reviews__btns">
                <LsSlideBtnPrev
                    @click="prev"
                    :class="currentSlide === 0 ? 'ls-slide-btn--disabled' : ''"
                />
                <LsSlideBtnNext
                    @click="next"
                    :class="
                        currentSlide === reviews.length - 1
                            ? 'ls-slide-btn--disabled'
                            : ''
                    "
                />
            </div>
        </div>
        <div class="ls-reviews__wrapper">
            <div
                class="ls-reviews__carousel"
                :style="{ 'margin-left': '-' + 100 * currentSlide + '%' }"
            >
                <LsReview
                    v-for="(item, key) in reviews"
                    :item="item"
                    :key="key"
                />
            </div>
        </div>
    </section>
</template>
<script setup>
const currentSlide = ref(0);
const reviews = [
    {
        name: 'ООО «Арсенал недвижимость»',
        city: 'Санкт-Петербург',
        description:
            'Обратились в компанию за созданием системы управления пропусками на парковках, составили техническое задание. С чего началось наше сотрудничество, после составления тех. задания мы получили четкое описание того, как будет работать система. Были предложены неучтенные нами доработки с описанием тех плюсов, которые мы и наши клиенты получат при принятии нами этих доработок. Что в итоге мы получили: легкий и быстрый пропуск клиентов на стоянку, четкий анализ свободных мест, возможность управления потоками клиентов, анализ заполняемости как по времени, так и по дням; это позволяет нам рекомендовать клиентам наиболее благоприятное время посещения парковки, тем самым увеличив безопасность движения на стоянке и лояльность посетителей. И все это вместе увеличило доходность от стоянки на 20%.',
        imgSrc: '/leadingsoft/images/ls-our-clients/arsenal.png',
    },
    {
        name: 'Чайка Телеком Петербург',
        city: 'Санкт-Петербург',
        description:
            'Компания ЛидинСофт — это наш давний партнер, которому мы доверили создание внутренних продуктов для нашей компании. Грамотная и своевременная поддержка, наш нашими проектами работала целая команда специалистов. Делают все в сроки, никогда не подводили, очень приятно иметь с ними дело. Сейчас наше сотрудничество продолжается. Рекомендуем!',
        imgSrc: '/leadingsoft/images/ls-our-clients/Logo_chaika.svg',
    },
    {
        name: 'ООО «Авантаж-недвижимость»',
        city: 'Санкт-Петербург',
        description:
            'Компания ЛидинСофт — это наш давний партнер, которому мы доверили создание внутренних продуктов для нашей компании. Грамотная и своевременная поддержка, наш нашими проектами работала целая команда специалистов. Делают все в сроки, никогда не подводили, очень приятно иметь с ними дело. Сейчас наше сотрудничество продолжается. Рекомендуем!',
        imgSrc: '/leadingsoft/images/ls-our-clients/avantage.png',
    },
    {
        name: 'Клининг Сити',
        city: 'Санкт-Петербург',
        description:
            'Благодарим компанию ЛидингСофт за оперативное решение проблем связанных с сайтом и другими нуждами нашей компании. Команда всегда быстро реагирует на вопросы и решает их, предлагает что-то новое и находит оперативное решение наших проблем.',
        imgSrc: '/leadingsoft/images/ls-our-clients/Logo_cleancity.png',
    },
];

/**
 * Description
 * @returns {any}
 */
const next = () => {
    if (currentSlide.value < reviews.length - 1) {
        currentSlide.value++;
    }
};
/**
 * Description
 * @returns {any}
 */
const prev = () => {
    if (currentSlide.value > 0) {
        currentSlide.value--;
    }
};
</script>
