<template>
    <section class="ls-why-us">
        <div class="ls-why-us__title">
            <p class="ls-h2">Почему мы</p>
            <p class="ls-why-us__text">
                Наш многолетний опыт разработки программных продуктов под ключ
                позволит вам избежать типичных ошибок и переплат. Эффективность
                разработки зависит не только от профессионализма специалистов,
                но и от грамотно выстроенных процессов разработки и управления.
            </p>
        </div>

        <div class="ls-why-us__cards">
            <div
                class="ls-why-us__card"
                v-for="(card, key) in cards"
                :class="
                    card.type === 'dark'
                        ? 'ls-why-us__card--dark'
                        : 'ls-why-us__card--light'
                "
            >
                <p class="ls-h3">{{ card.title }}</p>
                <ul>
                    <li v-for="(item, key) in card.list">{{ item }}</li>
                </ul>
            </div>
        </div>
    </section>
</template>
<script setup>
const cards = [
    {
        title: 'Грамотный подход',
        list: [
            'Сформированные процессы управления, разработки и контроля качества IT-продуктов. ',
            'Ежедневный анализ метрик.',
            'Постоянная связь с личным менеджером и командой IT-продукта.',
            'Осведомленность о ходе работы над проектом Четкий результат в ожидаемые сроки.',
        ],
    },
    {
        title: 'Команда профессионалов',
        list: [
            'Тщательный подбор команды для IT-продукта. ',
            'Только квалифицированные специалисты в команде: проектные менеджеры, архитекторы, аналитики, разработчики, дизайнеры QA-инженеры, UX/СХ-специалисты. ',
            'Накапливаем уникальный опыт в проектах, который используем для разработки успешных систем.',
        ],
        type: 'dark',
    },
    {
        title: 'Системный подход',
        list: [
            'Системный подход в общении с клиентами и в разработке новых продуктов. ',
            'Говорим на одном языке с нашими клиентами. Грамотно выстраиваем рабочий процесс, быстро вникаем в предметную область и демонстрируем отличные результаты.',
        ],
        type: 'dark',
    },
    {
        title: 'Перспективы',
        list: [
            'Учитываем развитие технологий и возможности масштабирования наших продуктов в будущем. ',
            'Строим архитектуру на основе компонентного подхода и используем непрерывную интеграцию (CI). ',
            'Минимизируем затраты на развитие и обеспечиваем автоматическую сборку, тестирование и установку продукта.',
        ],
    },
];
</script>
