<template>
    <Head>
        <Title>Радиоэлектронные устройства</Title>
    </Head>
    <LsBreadcrumbs>Радиоэлектронные устройства</LsBreadcrumbs>
    <p class="ls-about-product__title ls-h1">
        Разработка радиоэлектронных устройств с использованием отечественной
        компонентной базы под ваши задачи
    </p>
    <p class="ls-about-product__info">
        Для получения более подробной информации, пожалуйста, свяжитесь с нами
        по телефону <a href="tel:+78124073614">+7-812-407-36-14</a> или через
        форму обратной связи.
    </p>
    <LsOrder />
</template>
